#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Format 🤖`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bluemage/bloodbot/runs/run-tuowEN2tfWFHSCyz

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Initializing plugins and modules...
module.lambda_function.data.external.archive_prepare[0]: Reading...
null_resource.example: Refreshing state... [id=7109877742741326575]
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=a64033c6ed370cf7d4d7a0307f64ae27cf36d90e]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5534777091609505178]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.lambda_function.data.aws_partition.current: Reading...
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
data.aws_region.current: Reading...
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/bloodbot]
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Reading...
module.s3_bucket.data.aws_canonical_user_id.this: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.eventbridge.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2423734833]
data.aws_region.current: Read complete after 0s [id=ca-central-1]
data.aws_caller_identity.current: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=bloodbot-state-storage]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=bloodbot]
module.eventbridge.aws_iam_role.eventbridge[0]: Refreshing state... [id=default]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=573908012280]
data.aws_caller_identity.current: Read complete after 0s [id=573908012280]
module.eventbridge.data.aws_cloudwatch_event_bus.this[0]: Read complete after 0s [id=default]
module.s3_bucket.data.aws_canonical_user_id.this: Read complete after 0s [id=d437de9841be7b0448578b615b4cceb1f3aea5f51de78171afba3bc511d4d96e]
module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3969223859]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::573908012280:policy/bloodbot-logs]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=bloodbot-state-storage]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=bloodbot-state-storage,private]
module.lambda_function.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=bloodbot-state-storage]
module.lambda_function.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=236293281]
module.lambda_function.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::573908012280:policy/bloodbot-inline]
module.eventbridge.aws_cloudwatch_event_rule.this["cron"]: Refreshing state... [id=cron-rule]
module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=bloodbot-20220925014630948600000001]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=bloodbot-20220925014630981800000002]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=bloodbot]
module.eventbridge.aws_cloudwatch_event_target.this["lambda-cron"]: Refreshing state... [id=cron-rule-terraform-20220925015638232100000001]
module.lambda_function.aws_lambda_permission.current_version_triggers["cron"]: Refreshing state... [id=cron]
module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["cron"]: Refreshing state... [id=cron]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/f4c544500c5f4f5fdf68899c8026a239f85cb147ccbea47d36591bb9a74702ee.zip" -> "builds/4da09ca12a2a52e03ae2c4a6c5752fb2c1cc9d72524d1238f1c7fe3e6c01559f.zip"
        id                             = "bloodbot"
      ~ last_modified                  = "2022-12-18T04:00:44.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:573908012280:function:bloodbot:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:573908012280:function:bloodbot:17/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["cron"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "cron" -> (known after apply)
      ~ qualifier           = "17" -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "pip",
                      + "python3.8",
                      + "./src/requirements.txt",
                      + null,
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./src",
                      + null,
                    ],
                ]
              + filename      = "builds/4da09ca12a2a52e03ae2c4a6c5752fb2c1cc9d72524d1238f1c7fe3e6c01559f.zip"
              + runtime       = "python3.8"
            }
        )
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/4da09ca12a2a52e03ae2c4a6c5752fb2c1cc9d72524d1238f1c7fe3e6c01559f.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5534777091609505178" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f4c544500c5f4f5fdf68899c8026a239f85cb147ccbea47d36591bb9a74702ee.zip" -> "builds/4da09ca12a2a52e03ae2c4a6c5752fb2c1cc9d72524d1238f1c7fe3e6c01559f.zip"
          ~ "timestamp" = "1671335981259693000" -> "1671336267337744000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.


```

</details>

*Pushed by: @tribats, Action: `pull_request`*